{
  "hello": [
    "Hello! How can I help you today?",
    "Hi there! What would you like to know?",
    "Hello! I'm ready when you are."
  ],
  "hi": [
    "Hi! How can I assist?",
    "Hello! What can I do for you?",
    "Hey! Need a hand with something?"
  ],
  "assalam o alaikum": [
    "Wa Alaikum Assalam! How may I help you?",
    "Walaikum Salam! What would you like to do?"
  ],
  "salam": [
    "Walaikum Salam! How can I assist?"
  ],
  "how are you": [
    "I'm doing great, thanks! How can I help you today?",
    "All good here! What can I do for you?"
  ],
  "who are you": [
    "I'm your assistant, here to help with information and tasks.",
    "I'm your smart assistant. Ask me anything!"
  ],
  "your name": [
    "I'm VocalXpert, your intelligent assistant.",
    "You can call me VocalXpert."
  ],
  "what can you do": [
    "I can answer questions, open websites, manage simple tasks, and share helpful information.",
    "I can chat, fetch information, open relevant sites, and help with your study and day-to-day queries."
  ],
  "help": [
    "Try asking about MCS, NUST, PMA, Pakistan Army, Signal Corps, or instructors for DSA, EDC, CP, and MVC.",
    "You can say things like: 'tell me about MCS', 'who teaches DSA', or 'open NUST website'."
  ],

  "who teaches dsa": [
    "Data Structures and Algorithms (DSA) is taught by Lt Col Imran Javed.",
    "DSA instructor: Lt Col Imran Javed."
  ],
  "dsa instructor": [
    "Lt Col Imran Javed teaches DSA."
  ],
  "who teaches edc": [
    "Electronic Devices and Circuits (EDC) is taught by Zeeshan Zahid.",
    "EDC instructor: Zeeshan Zahid."
  ],
  "edc instructor": [
    "Zeeshan Zahid teaches EDC."
  ],
  "who teaches cp": [
    "Computer Programming (CP) is taught by Lt Col Raza.",
    "CP instructor: Lt Col Raza."
  ],
  "cp instructor": [
    "Lt Col Raza teaches CP."
  ],
  "who teaches mvc": [
    "MVC is taught by Ma'am Farhanda.",
    "MVC instructor: Ma'am Farhanda."
  ],
  "mvc instructor": [
    "Ma'am Farhanda teaches MVC."
  ],

  "what is mcs": [
    "The Military College of Signals (MCS) is a constituent college of NUST, known for excellence in Computer Science, Electrical Engineering, and Cyber disciplines.",
    "MCS is a premier institution of NUST focusing on communications, computing, and leadership.",
    "MCS blends strong academics with discipline and innovation, preparing students for real-world impact."
  ],
  "tell me about mcs": [
    "MCS, part of NUST, has a rich heritage in communications and computing education, fostering research, professionalism, and service.",
    "At MCS, students learn cutting-edge CS and EE with an emphasis on ethics, teamwork, and problem solving."
  ],
  "history of mcs": [
    "MCS has roots in Pakistan's communications training, evolving with NUST to lead in modern CS, EE, and cyber education.",
    "From early communications training to advanced labs and research, MCS has grown into a center of excellence within NUST."
  ],

  "what is signal corps": [
    "The Pakistan Army Signal Corps provides secure, reliable communications across the battlefield and in support of national operations.",
    "Signal Corps engineers and technicians ensure connectivity, cyber defense, and modern C4I capabilities for the Army."
  ],
  "tell me about signal corps": [
    "The Signal Corps is the communications backbone of the Army, enabling command and control through resilient networks and systems.",
    "Since independence, the Signal Corps has modernized from analog to digital, satellite, and secure data networks."
  ],
  "history of signal corps": [
    "Established at independence, the Signal Corps has supported every major operation with dependable communications and technological advancement.",
    "Over decades, the Corps evolved to deliver secure, mobile, and high-capacity communications for the Army."
  ],

  "tell me about pakistan army": [
    "The Pakistan Army is a professional land force known for defense, peacekeeping, disaster relief, and nation-building contributions.",
    "Beyond defense, the Army supports humanitarian missions, infrastructure, and education across the country."
  ],
  "what is pakistan army": [
    "A disciplined and mission-focused military service responsible for national defense and support to civil authorities when needed.",
    "It is among the largest armed forces in the region, committed to professionalism and service."
  ],

  "what is nust": [
    "NUST (National University of Sciences and Technology) is a top-tier Pakistani university known for engineering, computing, and innovation.",
    "NUST fosters research, startups, and leadership across its constituent colleges, including MCS."
  ],
  "tell me about nust": [
    "NUST offers world-class programs in engineering, IT, natural sciences, and management, with strong industry linkages.",
    "With modern campuses and labs, NUST emphasizes quality education, research, and entrepreneurship."
  ],

  "what is pma": [
    "The Pakistan Military Academy (PMA) at Kakul is the premier training institution for Army officers.",
    "PMA focuses on leadership, character, and military skills to commission capable officers."
  ],
  "tell me about pma": [
    "PMA Kakul delivers rigorous academic, physical, and leadership training for cadets destined to lead in the Pakistan Army.",
    "The Academy instills discipline, integrity, and service to the nation."
  ],

  "pakistan independence day": [
    "Pakistan celebrates Independence Day on 14 August 1947.",
    "Independence Day is 14th August, marking the creation of Pakistan in 1947."
  ],
  "when was pakistan founded": [
    "Pakistan was founded on 14 August 1947.",
    "The country came into being on 14th August 1947."
  ],
  "founder of pakistan": [
    "Quaid-e-Azam Muhammad Ali Jinnah is the founder of Pakistan.",
    "Pakistan's founder is Muhammad Ali Jinnah, known as Quaid-e-Azam."
  ],
  "who is quaid e azam": [
    "Quaid-e-Azam Muhammad Ali Jinnah led the Pakistan Movement and became the nation's first Governor-General.",
    "Muhammad Ali Jinnah is revered as the founder and a symbol of integrity and leadership."
  ],
  "who is muhammad ali jinnah": [
    "Muhammad Ali Jinnah (Quaid-e-Azam) was the leader of the Pakistan Movement and Pakistan's first Governor-General.",
    "He is remembered for his vision, determination, and statesmanship."
  ],
  "who is allama iqbal": [
    "Allama Muhammad Iqbal was a philosopher-poet who inspired the idea of a separate homeland for Muslims of South Asia.",
    "Iqbal is celebrated for his poetry, thought leadership, and influence on the Pakistan Movement."
  ],
  "who is sir syed ahmad khan": [
    "Sir Syed Ahmad Khan was an educationist and reformer who founded the Aligarh Movement to promote modern education.",
    "He emphasized scientific learning and social progress in the subcontinent."
  ],
  "who is abdus salam": [
    "Dr. Abdus Salam was a Nobel Prize-winning physicist from Pakistan for his contributions to electroweak theory.",
    "He advanced theoretical physics and helped build Pakistan's scientific institutions."
  ],
  "who is m m alam": [
    "Air Commodore M. M. Alam was a celebrated fighter pilot known for his exceptional aerial combat achievements.",
    "M. M. Alam is remembered for valor and skill in the 1965 war."
  ],
  "who is rashid minhas": [
    "Pilot Officer Rashid Minhas is a Nishan-e-Haider recipient who sacrificed his life to prevent aircraft hijacking.",
    "Rashid Minhas is honored for supreme courage and patriotism."
  ],
  "what is nishan e haider": [
    "Nishan-e-Haider is Pakistan's highest military gallantry award for extraordinary bravery.",
    "It is awarded for acts of supreme valor in the face of the enemy."
  ],

  "capital of pakistan": [
    "Islamabad is the capital of Pakistan.",
    "The capital city is Islamabad."
  ],
  "national language of pakistan": [
    "Urdu is the national language of Pakistan.",
    "National language: Urdu."
  ],
  "largest city of pakistan": [
    "Karachi is the largest city of Pakistan.",
    "The biggest city by population is Karachi."
  ],
  "pakistan flag": [
    "The flag of Pakistan is green and white with a crescent and star, symbolizing progress and light.",
    "Pakistan's flag: dark green with a white vertical stripe, crescent, and star."
  ],
  "pakistan anthem": [
    "Pakistan's national anthem is Qaumi Tarana, written by Hafeez Jalandhari.",
    "The anthem 'Qaumi Tarana' was composed by Ahmad G. Chagla and penned by Hafeez Jalandhari."
  ],
  "pakistan resolution day": [
    "Pakistan Day is observed on 23 March, commemorating the Lahore Resolution of 1940.",
    "23rd March marks Pakistan Resolution Day."
  ],
  "defence day": [
    "Defence Day is observed on 6 September to honor the armed forces' sacrifices.",
    "6th September is Defence Day in Pakistan."
  ],
  "iqbal day": [
    "Iqbal Day is observed on 9 November in memory of Allama Iqbal.",
    "9th November is celebrated as Iqbal Day."
  ],
  "quaid day": [
    "Quaid Day is observed on 25 December, the birthday of Muhammad Ali Jinnah.",
    "25th December is celebrated as Quaid Day."
  ],
  "kashmir day": [
    "Kashmir Day is observed on 5 February to show solidarity with the people of Kashmir.",
    "5th February is Kashmir Solidarity Day."
  ],

  "thank you": [
    "You're welcome!",
    "Happy to help!",
    "Anytime!"
  ],
  "bye": [
    "Goodbye! Take care.",
    "See you later!",
    "Bye! Have a great day."
  ],
  "goodbye": [
    "Goodbye!",
    "Have a nice day!"
  ],
  "tell me a joke": [
    "Why do programmers prefer dark mode? Because light attracts bugs!",
    "I told my computer I needed a break, and it said 'No problem — I'll go to sleep.'"
  ],
  "tell me a quote": [
    "'There is no power on earth that can undo Pakistan.' — Muhammad Ali Jinnah",
    "'The ultimate aim of the ego is not to see something, but to be something.' — Allama Iqbal"
  ]
}
